1s/ERP/extensions/liko/DataProcessors/ЯССМ_АктБрака.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЯССМ_АктБрака</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗабраковкаМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомисии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйТехнолог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальникОтделаЗакупок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеНедостатков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

1s/ERP/extensions/liko/AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтбору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КРазмещению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СерииНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерКиЗГИСМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерКиЗГИСМ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерСерии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЯССМ_ОбъектНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>RFIDUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>EPCGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>RFIDМеткаНеЧитаемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_ХарактеристикаВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_НомерПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_НомераПоставок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_ВесКоробки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_Втулка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Втулки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_ДатаУпаковки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_КоличествоВУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_КоличествоРоликов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_НаправлениеНамотки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_Упаковщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_НомерКоробки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_ВладелецКомплекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/extensions/liko/DataProcessors/ЯССМ_АктБрака/Forms/ОтчетУпр/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
	
	ТабДокумент=Новый ТабличныйДокумент;
	
	ПечатьАкта(ТабДокумент);
	ТабДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Функция НайтиПриходныйОрдер(Серия) //+Лико m.shenderov 14.02.2019  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыВЯчейках.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
	|ГДЕ
	|	ТоварыВЯчейках.Серия = &Серия
	|	И (ТоварыВЯчейках.Регистратор.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
	|			ИЛИ ТоварыВЯчейках.Регистратор.Распоряжение ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|			ИЛИ ТоварыВЯчейках.Регистратор ССЫЛКА Документ.Лико_БланкЭтапа)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыВЯчейках.Период";
	Запрос.УстановитьПараметр("Серия",Серия );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.ПриходныйОрдерНаТовары") и 
			(ТипЗнч(Выборка.Регистратор.Распоряжение)=Тип("ДокументСсылка.ЗаказПоставщику")
			Или ТипЗнч(Выборка.Регистратор.Распоряжение)=Тип("ДокументСсылка.ПриобретениеТоваровУслуг")) Тогда
			Возврат Выборка.Регистратор;			
		ИначеЕсли   ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.Лико_БланкЭтапа") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Лико_БланкЭтапаТовары.Серия КАК Серия
			|ИЗ
			|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
			|ГДЕ
			|	Лико_БланкЭтапаТовары.Списать
			|	И Лико_БланкЭтапаТовары.Ссылка = &Ссылка
			|	И Лико_БланкЭтапаТовары.Номенклатура = &Номенклатура";
			Запрос.УстановитьПараметр("Ссылка",Выборка.Регистратор );
			Запрос.УстановитьПараметр("Номенклатура",Серия.ЯССМ_ОбъектНоменклатуры.Номенклатура);
			
			РезультатЗапроса2 = Запрос.Выполнить();
			Выборка2 = РезультатЗапроса2.Выбрать();
			Пока Выборка2.Следующий() Цикл
				Если Серия=Выборка2.Серия Тогда
					Возврат Неопределено;
				КонецЕсли;
				Возврат	НайтиПриходныйОрдер(Выборка2.Серия);
			КонецЦикла;			
		КонецЕсли;		
	КонецЦикла; 	
КонецФункции  //-Лико m.shenderov 14.02.2019

&НаСервере
Функция ПолучитьПоступлениеТоваров(СтрокаТз,ПриходныйОрдер);   //+Лико m.shenderov 14.02.2019
	Структура = Новый Структура;
	Структура.Вставить("Цена");
	Структура.Вставить("НомерПриход");
	Структура.Вставить("ДатаПриход");
	Структура.Вставить("Валюта");
	Структура.Вставить("ЦенаВключаетНДС");
	
	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_ТоварыКПоступлению.Регистратор КАК ДокументПоступления
	|ПОМЕСТИТЬ ВтПоступление
	|ИЗ
	|	РегистрНакопления.Лико_ТоварыКПоступлению КАК Лико_ТоварыКПоступлению
	|ГДЕ
	|	Лико_ТоварыКПоступлению.ПриходныйОрдер = &ПриходныйОрдер
	|	И Лико_ТоварыКПоступлению.Номенклатура = &Номенклатура
	|	И Лико_ТоварыКПоступлению.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриобретениеТоваровУслугТовары.Цена КАК Цена,
	|	ПриобретениеТоваровУслугТовары.Ссылка.ДатаВходящегоДокумента КАК ДатаПриход,
	|	ПриобретениеТоваровУслугТовары.Ссылка.НомерВходящегоДокумента КАК НомерПриход,
	|	ПриобретениеТоваровУслугТовары.Ссылка.Валюта КАК Валюта,
	|	ПриобретениеТоваровУслугТовары.Ссылка.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ИЗ
	|	ВтПоступление КАК ВтПоступление
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ПО ВтПоступление.ДокументПоступления = ПриобретениеТоваровУслугТовары.Ссылка";
	Запрос.УстановитьПараметр("ПриходныйОрдер",ПриходныйОрдер );
	Запрос.УстановитьПараметр("Номенклатура",СтрокаТз.Номенклатура );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(Структура,Выборка);	
		
		
	КонецЦикла; 
	
	Возврат Структура;	
	
	
КонецФункции  //-Лико m.shenderov 14.02.2019






&НаСервере
Процедура ЗаполнитьЦенуПоПоступлению(СтрокаТз,ПриходныйОрдер=Неопределено) //+Лико m.shenderov 13.02.2019
	Если Не ЗначениеЗаполнено(ПриходныйОрдер) Тогда
		ПриходныйОрдер=НайтиПриходныйОрдер(СтрокаТз.Серия);
		Если ЗначениеЗаполнено(ПриходныйОрдер) Тогда  	
			ЗаполнитьЦенуПоПоступлению(СтрокаТз,ПриходныйОрдер);  			
		КонецЕсли;
	Иначе
		ЗаполнитьЗначенияСвойств(СтрокаТз,ПолучитьПоступлениеТоваров(СтрокаТз,ПриходныйОрдер));		
	КонецЕсли;
	
	
	
КонецПроцедуры  //-Лико m.shenderov 13.02.2019



Функция ПечатьАкта(ТабДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Если ЕстьПодпись Тогда
		Макет = ОбработкаОбъект.ПолучитьМакет("МакетСПодисью");
	Иначе
		Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
	КонецЕсли;
	
	НомерФормы = "";
	Если ТипЗнч(Объект.СсылкаНаОбъект) = Тип("ДокументСсылка.Лико_ПередачаТоваров") Тогда
		Тз=Объект.СсылкаНаОбъект.Товары.Выгрузить();
		Организация = Объект.СсылкаНаОбъект.Организация;
		Дата = Объект.СсылкаНаОбъект.Дата;
		ДатаФормированияАктаБрака = Объект.СсылкаНаОбъект.ДатаФормированияАктаБрака;
		Контрагент = Объект.СсылкаНаОбъект.Контрагент;
	ИначеЕсли ТипЗнч(Объект.СсылкаНаОбъект) = Тип("ДокументСсылка.Лико_ЗабраковкаМатериалов") Тогда
		Тз=Объект.СсылкаНаОбъект.Материалы.Выгрузить();
		Тз.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
		//Тз.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,2)));
		Для каждого Строка из ТЗ Цикл
			Строка.КоличествоУпаковок = Строка.Количество;
			Строка.Количество = Строка.МетражКВМ;
			Строка.Цена = 0;
		КонецЦикла;		
		НомерФормы = "Ф-07";
		Организация = Объект.СсылкаНаОбъект.Организация;
		Дата = Объект.СсылкаНаОбъект.Дата;
		ДатаФормированияАктаБрака = Объект.СсылкаНаОбъект.ДатаВыставленияПретензии;
		Контрагент = Объект.СсылкаНаОбъект.Поставщик;
	Иначе
		Сообщить("Тип документа """ + ТипЗнч(Объект.СсылкаНаОбъект) + """ не предусмотрен разработчиками");
		Возврат Неопределено;
	КонецЕсли;
	
	
	
	
	Запрос = Новый Запрос;
	
	Тз.Колонки.Добавить("НомерПриход",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная)));
	Тз.Колонки.Добавить("ДатаПриход",Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Тз.Колонки.Добавить("Валюта",Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Тз.Колонки.Добавить("ЦенаВключаетНДС",Новый ОписаниеТипов("Булево"));
	
	Для каждого СтрокаТз Из Тз Цикл
		ЗаполнитьЦенуПоПоступлению(СтрокаТз);
	КонецЦикла;
	
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Тз_Цены.НомерПриход КАК НомерПриход,
	//|	Тз_Цены.Серия КАК Серия,
	//|	Тз_Цены.ДатаПриход КАК ДатаПриход,
	//|	Тз_Цены.Цена КАК Цена,
	//|	Тз_Цены.Валюта КАК Валюта,
	//|	Тз_Цены.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	//|ПОМЕСТИТЬ ВтЦены
	//|ИЗ
	//|	&Тз КАК Тз_Цены
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Лико_ПередачаТоваровТовары.Серия КАК Серия,
	//|	Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	//|	Лико_ПередачаТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	//|	Лико_ПередачаТоваровТовары.Количество КАК Количество
	//|ПОМЕСТИТЬ ВтТовар
	//|ИЗ
	//|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	//|ГДЕ
	//|	Лико_ПередачаТоваровТовары.Ссылка = &ТекущийДокумент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВтТовар.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	//|	ВтТовар.КоличествоУпаковок КАК Количество,
	//|	ВтТовар.Количество КАК КоличествоУУ,
	//|	ПриходныйОрдерНаТоварыТовары.КоличествоУпаковок КАК КоличествоПриход,
	//|	ПриходныйОрдерНаТоварыТовары.Количество КАК КоличествоПриходУу,
	//|	ВтЦены.НомерПриход КАК НомерПриход,
	//|	ВтЦены.ДатаПриход КАК ДатаПриход,
	//|	ПриходныйОрдерНаТоварыТовары.Ссылка КАК СсылкаПриход,
	//|	ВтЦены.Валюта КАК ВалютаДокумента,
	//|	ВтЦены.ЦенаВключаетНДС КАК Лико_ЦенаВключаетНДС,
	//|	0 КАК СуммаСНДСПриход,
	//|	0 КАК СуммаСНДС,
	//|	ВтЦены.Цена КАК Цена
	//|ПОМЕСТИТЬ Вт
	//|ИЗ
	//|	ВтТовар КАК ВтТовар
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	//|		ПО (ПриходныйОрдерНаТоварыТовары.Серия.ЯССМ_ОбъектНоменклатуры = ВтТовар.ОбъектНоменклатуры)
	//|			И (ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение ССЫЛКА Документ.ЗаказПоставщику)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЦены КАК ВтЦены
	//|		ПО ВтТовар.Серия = ВтЦены.Серия
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Вт.ОбъектНоменклатуры.Номенклатура КАК Номенклатура,
	//|	Вт.ОбъектНоменклатуры.Нарезка КАК Нарезка,
	//|	Вт.ОбъектНоменклатуры.Втулка КАК Втулка,
	//|	Вт.НомерПриход КАК НомерПриход,
	//|	Вт.ДатаПриход КАК ДатаПриход,
	//|	СУММА(Вт.Количество) КАК Количество,
	//|	СУММА(Вт.КоличествоУУ) КАК КоличествоУУ,
	//|	СУММА(Вт.КоличествоПриход) КАК КоличествоПриход,
	//|	СУММА(Вт.КоличествоПриходУу) КАК КоличествоУУПриход,
	//|	Вт.СсылкаПриход КАК СсылкаПриход,
	//|	Вт.ВалютаДокумента КАК ВалютаДокумента,
	//|	Вт.Лико_ЦенаВключаетНДС КАК Лико_ЦенаВключаетНДС,
	//|	СУММА(Вт.СуммаСНДСПриход) КАК СуммаСНДСПриход,
	//|	СУММА(Вт.СуммаСНДС) КАК СуммаСНДС,
	//|	Вт.ОбъектНоменклатуры.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	Вт.Цена КАК Цена
	//|ИЗ
	//|	Вт КАК Вт
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Вт.ОбъектНоменклатуры.Номенклатура,
	//|	Вт.ОбъектНоменклатуры.Нарезка,
	//|	Вт.ОбъектНоменклатуры.Втулка,
	//|	Вт.ДатаПриход,
	//|	Вт.НомерПриход,
	//|	Вт.СсылкаПриход,
	//|	Вт.ОбъектНоменклатуры.БазоваяЕдиницаИзмерения,
	//|	Вт.ВалютаДокумента,
	//|	Вт.Лико_ЦенаВключаетНДС,
	//|	Вт.Цена
	//|ИТОГИ ПО
	//|	ВалютаДокумента";
	
	"ВЫБРАТЬ
	|	Тз_Цены.НомерПриход КАК НомерПриход,
	|	ВЫРАЗИТЬ(Тз_Цены.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	|	Тз_Цены.ДатаПриход КАК ДатаПриход,
	|	Тз_Цены.Цена КАК Цена,
	|	Тз_Цены.Валюта КАК Валюта,
	|	Тз_Цены.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	Тз_Цены.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Тз_Цены.Количество КАК Количество
	|ПОМЕСТИТЬ ВтЦены
	|ИЗ
	|	&Тз КАК Тз_Цены
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЦены.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	ВтЦены.КоличествоУпаковок КАК Количество,
	|	ВтЦены.Количество КАК КоличествоУУ,
	|	ПриходныйОрдерНаТоварыТовары.КоличествоУпаковок КАК КоличествоПриход,
	|	ПриходныйОрдерНаТоварыТовары.Количество КАК КоличествоПриходУу,
	|	ВтЦены.НомерПриход КАК НомерПриход,
	|	ВтЦены.ДатаПриход КАК ДатаПриход,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка КАК СсылкаПриход,
	|	ВтЦены.Валюта КАК ВалютаДокумента,
	|	ВтЦены.ЦенаВключаетНДС КАК Лико_ЦенаВключаетНДС,
	|	0 КАК СуммаСНДСПриход,
	|	0 КАК СуммаСНДС,
	|	ВтЦены.Цена КАК Цена
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	ВтЦены КАК ВтЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|		ПО (ПриходныйОрдерНаТоварыТовары.Серия = ВтЦены.Серия)
	|			И (ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение ССЫЛКА Документ.ЗаказПоставщику)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.ОбъектНоменклатуры.Номенклатура КАК Номенклатура,
	|	Вт.ОбъектНоменклатуры.Нарезка КАК Нарезка,
	|	Вт.ОбъектНоменклатуры.Втулка КАК Втулка,
	|	Вт.НомерПриход КАК НомерПриход,
	|	Вт.ДатаПриход КАК ДатаПриход,
	|	СУММА(Вт.Количество) КАК Количество,
	|	СУММА(Вт.КоличествоУУ) КАК КоличествоУУ,
	|	СУММА(Вт.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(Вт.КоличествоПриходУу) КАК КоличествоУУПриход,
	|	Вт.СсылкаПриход КАК СсылкаПриход,
	|	Вт.ВалютаДокумента КАК ВалютаДокумента,
	|	Вт.Лико_ЦенаВключаетНДС КАК Лико_ЦенаВключаетНДС,
	|	СУММА(Вт.СуммаСНДСПриход) КАК СуммаСНДСПриход,
	|	СУММА(Вт.СуммаСНДС) КАК СуммаСНДС,
	|	Вт.ОбъектНоменклатуры.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Вт.Цена КАК Цена
	|ИЗ
	|	Вт КАК Вт
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.ОбъектНоменклатуры.Номенклатура,
	|	Вт.ОбъектНоменклатуры.Нарезка,
	|	Вт.ОбъектНоменклатуры.Втулка,
	|	Вт.ДатаПриход,
	|	Вт.НомерПриход,
	|	Вт.СсылкаПриход,
	|	Вт.ОбъектНоменклатуры.БазоваяЕдиницаИзмерения,
	|	Вт.ВалютаДокумента,
	|	Вт.Лико_ЦенаВключаетНДС,
	|	Вт.Цена
	|ИТОГИ ПО
	|	ВалютаДокумента";
	
	
	Запрос.УстановитьПараметр("тз", Тз);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаТТН = РезультатЗапроса.Выгрузить();
	
	ВыборкаВалютаДокумента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВозвратТоваровПоставщику_АктПриемкиПоКачеству";
	ТабДокумент.ЭкземпляровНаСтранице=1;
	ТабДокумент.МасштабПечати=89;
	
	ПредседательКомисии=Объект.ПредседательКомисии;
	ГлавныйТехнолог=Объект.ГлавныйТехнолог;
	НачальникОтделаЗакупок=Объект.НачальникОтделаЗакупок;
	
	// Выводим шапку накладной
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//ОбластьМакета.Параметры.Заполнить(Объект.СсылкаНаОбъект);
	ОбластьМакета.Параметры.Организация = Организация;
	
	ФИО			= ПредседательКомисии.Наименование;
	Фамилия		= ВыделитьСлово(ФИО);
	Имя			= ВыделитьСлово(ФИО);
	Отчество	= ВыделитьСлово(ФИО);
	Председатель= Фамилия+" "+Лев(имя,1)+"."+Лев(Отчество,1)+".";
	
	ФИО			=ГлавныйТехнолог.Наименование;
	Фамилия		= ВыделитьСлово(ФИО);
	Имя			= ВыделитьСлово(ФИО);
	Отчество	= ВыделитьСлово(ФИО);
	Технолог    = Фамилия+" "+Лев(имя,1)+"."+Лев(Отчество,1)+".";
	
	ФИО=НачальникОтделаЗакупок.Наименование;
	Фамилия		= ВыделитьСлово(ФИО);
	Имя			= ВыделитьСлово(ФИО);
	Отчество	= ВыделитьСлово(ФИО);
	НачальникОтдела=Фамилия+" "+Лев(имя,1)+"."+Лев(Отчество,1)+".";
	
	ОбластьМакета.Параметры.ПредседательКомиссии=Председатель;
	ОбластьМакета.Параметры.ГлавныйТехнолог=Технолог;
	ОбластьМакета.Параметры.НачальникОтдела=НачальникОтдела;
	
	Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Организация, Дата);
	Руководитель = Руководители.Руководитель;
	ПредставлениеОтправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Контрагент, Дата), "ПолноеНаименование, ЮридическийАдрес");
	ПредставлениеОрганизации  = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Организация, Дата), "ИНН,ЮридическийАдрес,КПП");
	
	ОбластьМакета.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
	ОбластьМакета.Параметры.ПредставлениеОтправителя = ПредставлениеОтправителя;
	ОбластьМакета.Параметры.Заголовок =  "Акт № " + ПолучитьНомерНаПечать(Объект.СсылкаНаОбъект) + " от " + Формат(ДатаФормированияАктаБрака, "ДФ='дд ММММ гггг'");
	ОбластьМакета.Параметры.НомерФормы = НомерФормы;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Вывести табличную часть ТТН
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТТН");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТТН");
	
	// ТТН
	ТаблицаТТН.Свернуть("СсылкаПриход, НомерПриход, ДатаПриход");
	
	Для Каждого СтрокаТТН Из ТаблицаТТН Цикл
		Если ЗначениеЗаполнено(СтрокаТТН.ДатаПриход) Тогда
			ОбластьМакета.Параметры.НомерДата = "" + СтрокаТТН.НомерПриход + " от " + Формат(СтрокаТТН.ДатаПриход,"ДЛФ=Д");
			ОбластьМакета.Параметры.СсылкаПриход = СтрокаТТН.СсылкаПриход;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ИтогоСумма = 0;
	ИтогоКоличество = 0;
	Ном      = 0;
	
	// Товары
	Пока ВыборкаВалютаДокумента.Следующий() Цикл
		
		// Вывести табличную часть  возврата
		ОбластьШапкиТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьШапкиТаблицы.Параметры.Валюта = ВыборкаВалютаДокумента.ВалютаДокумента;
		ТабДокумент.Вывести(ОбластьШапкиТаблицы);
		
		ИтогоКоличество = 0;
		ВыборкаСтрокТовары = ВыборкаВалютаДокумента.Выбрать();
		
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
				Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			Ном = Ном + 1;
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
			
			ОбластьМакета.Параметры.НомерСтроки = Ном;
			ОбластьМакета.Параметры.Товар       = СокрЛП(ВыборкаСтрокТовары.Номенклатура.НаименованиеПолное) + " (" + ВыборкаСтрокТовары.Номенклатура.Артикул + ")";
			
			ТабДокумент.Вывести(ОбластьМакета);
			ИтогоСумма = ИтогоСумма + ВыборкаСтрокТовары.СуммаСНДС;
			ИтогоКоличество = ИтогоКоличество + ВыборкаСтрокТовары.Количество;
		КонецЦикла;
		
	КонецЦикла;	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.ИтогоКоличество = ИтогоКоличество;
	ОбластьМакета.Параметры.ИтогоСумма = ИтогоСумма;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Вывести подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакета.Параметры.ОписаниеНедостатков=Объект.ОписаниеНедостатков;
	ОбластьМакета.Параметры.ПредседательКомиссии=Председатель;
	ОбластьМакета.Параметры.ГлавныйТехнолог=Технолог;
	ОбластьМакета.Параметры.НачальникОтдела=НачальникОтдела;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
КонецФункции

// Функция выделяет первое слово в предложении
Функция ВыделитьСлово(ИсходнаяСтрока) Экспорт
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции



// Процедура предназначена для преобразования номера документа.
//
// Параметры:
//  Документ - (ДокументСсылка), документ, чей номер надо получить для печати.
//
// Возвращаемое значение.
//  Строка - номер документа для печати
//
Функция ПолучитьНомерНаПечать(Документ, МассивПрефиксов = Неопределено) Экспорт
	
	Если Документ = Неопределено Тогда 
		Возврат 0;
	КонецЕсли;
	
	Номер   = СокрЛП(Документ.Номер);
	Префикс = "";
	Если МассивПрефиксов = Неопределено Тогда
		
		Организация = Неопределено;
		
		Если ТипЗнч(Документ) = Тип("ВыборкаИзРезультатаЗапроса")
			ИЛИ ТипЗнч(Документ) = Тип("Структура") Тогда
			
			Организация = Документ.Организация;
			
		Иначе
			
			МетаданныеДокумента = Документ.Метаданные();
			
			Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
				
				Организация = Документ.Организация;
				
			КонецЕсли;
			
		КонецЕсли;
		
		МассивПрефиксовДляОбхода = СформироватьМассивПрефиксовДляРИБИОрганизации(Организация)
		
	Иначе
		
		МассивПрефиксовДляОбхода = МассивПрефиксов;
		
	КонецЕсли;
	
	Для Каждого ТекущийПрефикс ИЗ МассивПрефиксовДляОбхода Цикл
		
		// удаление префикса из номера документа
		Если Найти(Номер, ТекущийПрефикс)=1 Тогда 
			Номер = Сред(Номер, СтрДлина(ТекущийПрефикс)+1);
		КонецЕсли;
		
		// так же, может остаться "минус" впереди
		Если Лев(Номер, 1) = "-" Тогда
			Номер = Сред(Номер, 2);
		КонецЕсли;
		
		// удаление ведущих нулей
		Пока Лев(Номер, 1)="0" Цикл
			Номер = Сред(Номер, 2);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Номер;
	
КонецФункции // ПолучитьНомерНаПечать()


Функция СформироватьМассивПрефиксовДляРИБИОрганизации(Организация) Экспорт
	
	МассивПрефиксов = ПолучитьМассивПрефиксовРИБ();	
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Префикс = СокрЛП(Организация.Префикс);
		
		Если Префикс <> "" Тогда
			МассивПрефиксов.Добавить(Префикс);
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивПрефиксов.Количество() = 0 Тогда
		МассивПрефиксов.Добавить("");
	КонецЕсли;
	
	Возврат МассивПрефиксов;
	
КонецФункции


Функция ПолучитьМассивПрефиксовРИБ()
	
	МассивПрефиксов = Новый Массив();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ Различные
	|	ПрефиксыИнформационныхБаз.Префикс КАК Префикс
	|ИЗ
	|	Справочник.Организации КАК ПрефиксыИнформационныхБаз";
	
	ВыборкаУзлов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаУзлов.Следующий() Цикл
		
		Если Не ПустаяСтрока(ВыборкаУзлов.Префикс) Тогда
			
			МассивПрефиксов.Добавить(ВыборкаУзлов.Префикс);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат МассивПрефиксов;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СсылкаНаОбъект") Тогда
		Объект.СсылкаНаОбъект=Параметры.СсылкаНаОбъект;
	КонецЕсли;
	
	Если Параметры.Свойство("ПредседательКомисии") Тогда
		Объект.ПредседательКомисии=Параметры.ПредседательКомисии;
	КонецЕсли;
	
	Если Параметры.Свойство("ГлавныйТехнолог") Тогда
		Объект.ГлавныйТехнолог=Параметры.ГлавныйТехнолог;
	КонецЕсли;
	
	Если Параметры.Свойство("НачальникОтделаЗакупок") Тогда
		Объект.НачальникОтделаЗакупок=Параметры.НачальникОтделаЗакупок;
	КонецЕсли;
	
	Если Параметры.Свойство("ОписаниеНедостатков") Тогда
		Объект.ОписаниеНедостатков=Параметры.ОписаниеНедостатков;
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 01.12.2021 
	Если ЗначениеЗаполнено(Объект.СсылкаНаОбъект) И ТипЗнч(Объект.СсылкаНаОбъект) = Тип("ДокументСсылка.Лико_ЗабраковкаМатериалов") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ГлавныйТехнолог) Тогда
			Объект.ГлавныйТехнолог = Объект.СсылкаНаОбъект.СотрудникПринявшийРешение;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ОписаниеНедостатков) Тогда
	 		Объект.ОписаниеНедостатков = "" + Объект.СсылкаНаОбъект.Дефект + ?(ЗначениеЗаполнено(Объект.СсылкаНаОбъект.ОписаниеДефекта), " (" + Объект.СсылкаНаОбъект.ОписаниеДефекта + ")", "");
		КонецЕсли;
		
		Если Объект.СсылкаНаОбъект.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
			Если НЕ ЗначениеЗаполнено(Объект.ПредседательКомисии) Тогда
				Объект.ПредседательКомисии = Справочники.ФизическиеЛица.НайтиПоНаименованию("Лещев Алексей Анатольевич");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.НачальникОтделаЗакупок) Тогда
				Объект.НачальникОтделаЗакупок = Справочники.ФизическиеЛица.НайтиПоНаименованию("Буянов Максим Александрович");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	// <-- Конец Лико Ефимов ЕВВ 01.12.2021 
	
КонецПроцедуры
